[M_PrincessAnotherCastle MissionDefinition]
MissionName="The princess lives in another palace."
MissionDescription=""
TurnInDescription=""
MissionSummary=""
MissionGiver=""
MissionTurnInLocation=""
TeaserText=""

[M_PrincessAnotherCastle:BringFluffyBack MissionObjectiveDefinition]
ProgressMessage="To take Prince Colon to Türkiye."

[M_PrincessAnotherCastle:GrabFluffy MissionObjectiveDefinition]
ProgressMessage="Defeat the giant donkey princess"

[M_PrincessAnotherCastle:KillGuards MissionObjectiveDefinition]
ProgressMessage="The guard killed him"

[M_PrincessAnotherCastle:KnockOnDoor MissionObjectiveDefinition]
ProgressMessage="He knocked on the door"

[M_PrincessAnotherCastle:LowerFlag MissionObjectiveDefinition]
ProgressMessage="Flag down"

[M_PrincessAnotherCastle:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:ObjSet_BringFluffyBack MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:ObjSet_GrabFluffy MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:ObjSet_KillGuards MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:Objset_LowerFlag MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:ObjSet_ReplaceFlag MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_PrincessAnotherCastle:ReplaceFlag MissionObjectiveDefinition]
ProgressMessage="Return the flag"

[M_PrincessAnotherCastle:SaveFluffy MissionObjectiveDefinition]
ProgressMessage="They go to jail"

